# RoofRafterOrTrussParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoofRafterOrTrussParam Property
ParameterTypeId Class See Also
---
"Rafter or Truss"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoofRafterOrTrussParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoofRafterOrTrussParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoofRafterOrTrussParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace